# Handling data

In [1]:
# import library and read csv file

import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/jacobjoe/data_for_jupyter_notebook/master/Salary.csv')
df.head()

  Company                  Job    Degree  Salary_more_than_100k
0  google      sales executive  bachelor                      0
1  google      sales executive    master                      0
2  google    bussiness manager  bachelor                      1
3  google    bussiness manager    master                      1
4  google  computer programmer  bachelor                      0

In [2]:
# take salary as target variable and others as inputs

inputs = df.drop('Salary_more_than_100k', axis = 1)
target = df['Salary_more_than_100k']

In [3]:
inputs

       Company                  Job    Degree
0       google      sales executive  bachelor
1       google      sales executive    master
2       google    bussiness manager  bachelor
3       google    bussiness manager    master
4       google  computer programmer  bachelor
5       google  computer programmer    master
6   abc pharma      sales executive    master
7   abc pharma  computer programmer  bachelor
8   abc pharma    bussiness manager  bachelor
9   abc pharma    bussiness manager    master
10    facebook      sales executive  bachelor
11    facebook      sales executive    master
12    facebook    bussiness manager  bachelor
13    facebook    bussiness manager    master
14    facebook  computer programmer  bachelor
15    facebook  computer programmer    master

In [4]:
target

0     0
1     0
2     1
3     1
4     0
5     1
6     0
7     0
8     0
9     1
10    1
11    1
12    1
13    1
14    1
15    1
Name: Salary_more_than_100k, dtype: int64

In [5]:
from sklearn.preprocessing import LabelEncoder

In [6]:
# create instance for the LabelEncoder

le_company = LabelEncoder()
le_job = LabelEncoder()
le_degree = LabelEncoder()

In [7]:
# fit_transform the inputs

inputs['company_n'] = le_company.fit_transform(inputs['Company'])
inputs['job_n'] = le_company.fit_transform(inputs['Job'])
inputs['degree_n'] = le_company.fit_transform(inputs['Degree'])
inputs.head()

  Company                  Job    Degree  company_n  job_n  degree_n
0  google      sales executive  bachelor          2      2         0
1  google      sales executive    master          2      2         1
2  google    bussiness manager  bachelor          2      0         0
3  google    bussiness manager    master          2      0         1
4  google  computer programmer  bachelor          2      1         0

In [9]:
inputs_n = inputs.drop(['Company', 'Job', 'Degree'], axis = 1)
inputs_n

    company_n  job_n  degree_n
0           2      2         0
1           2      2         1
2           2      0         0
3           2      0         1
4           2      1         0
5           2      1         1
6           0      2         1
7           0      1         0
8           0      0         0
9           0      0         1
10          1      2         0
11          1      2         1
12          1      0         0
13          1      0         1
14          1      1         0
15          1      1         1

In [10]:
# import tree from sklearn

from sklearn import tree

In [11]:
model = tree.DecisionTreeClassifier()

In [12]:
model.fit(inputs_n, target)

DecisionTreeClassifier()

In [13]:
model.score(inputs_n, target)

1.0

In [14]:
# predict
# inputs value in numerical format made by the labelencoder

model.predict([[2, 0, 1]])

array([1], dtype=int64)

In [16]:
model.predict([[2, 2, 0]])

array([0], dtype=int64)